# HeatTransferCoefficient Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
EnergyAnalysisWindowType..::..HeatTransferCoefficient Property
EnergyAnalysisWindowType Class See Also
---
The heat transfer coefficient value (U-value) of the window type.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public double HeatTransferCoefficient { get; }
```

Visual Basic
---
```text
Public ReadOnly Property HeatTransferCoefficient As Double
	Get
```

Visual C++
---
```text
public:
property double HeatTransferCoefficient {
	double get ();
}
```

# See Also
EnergyAnalysisWindowType Class
Autodesk.Revit.DB.Analysis Namespace